2016/brp 2016-02-09/test/testcases/legacy/src/main/resources/testcases/art_input_TechnischToegang/data/VerAntwMutatieberichtCorrectieAdres-TC02-1-dataresponse.xml

<Results>
    <ResultSet fetchSize="0">
        <Row rowNumber="1">
            <ABONNEMENT>5671003</ABONNEMENT>
            <DATA><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <brp:lvg_synVerwerkPersoon xmlns:brp="http://www.bzk.nl/brp/brp0200">
  <brp:stuurgegevens>
    <brp:zendendePartij>199903</brp:zendendePartij>
    <brp:zendendeSysteem>BRP</brp:zendendeSysteem>
    <brp:ontvangendePartij>034401</brp:ontvangendePartij>
    <brp:ontvangendeSysteem>Leveringsysteem</brp:ontvangendeSysteem>
    <brp:referentienummer>*</brp:referentienummer>
    <brp:tijdstipVerzending>*</brp:tijdstipVerzending>
  </brp:stuurgegevens>
  <brp:parameters>
    <brp:soortSynchronisatie>Mutatiebericht</brp:soortSynchronisatie>
    <brp:abonnementNaam>Abo met alleen verantwoordingsinfo True</brp:abonnementNaam>
    <brp:categorieDienst>Mutatielevering op basis van doelbinding</brp:categorieDienst>
  </brp:parameters>
  <brp:synchronisatie brp:objecttype="AdministratieveHandeling" brp:verwerkingssoort="Toevoeging">
    <brp:code>05008</brp:code>
    <brp:naam>Correctie adres</brp:naam>
    <brp:categorie>Correctie</brp:categorie>
    <brp:partijCode>036101</brp:partijCode>
    <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
    <brp:bijgehoudenPersonen>
      <brp:persoon brp:objecttype="Persoon" brp:verwerkingssoort="*" brp:communicatieID="1">
        <brp:soortCode>I</brp:soortCode>
        <brp:afgeleidAdministratief brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">
          <brp:actieInhoud>${actieIdCorrectieAdres1}</brp:actieInhoud>
          <brp:tijdstipLaatsteWijziging>*</brp:tijdstipLaatsteWijziging>

          <brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>N</brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>
        </brp:afgeleidAdministratief>
        <brp:afgeleidAdministratief brp:verwerkingssoort="Verval" brp:voorkomenSleutel="*">
          <brp:actieInhoud>${actieIdRegistratieGeboorte}</brp:actieInhoud>
          <brp:actieVerval>${actieIdCorrectieAdres1}</brp:actieVerval>
          <brp:tijdstipLaatsteWijziging>*</brp:tijdstipLaatsteWijziging>

          <brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>N</brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>
        </brp:afgeleidAdministratief>
        <brp:identificatienummers brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:actieInhoud>${actieIdRegistratieIdentificatienummers}</brp:actieInhoud>
          <brp:burgerservicenummer>900188005</brp:burgerservicenummer>
          <brp:administratienummer>9098517169</brp:administratienummer>
        </brp:identificatienummers>
        <brp:samengesteldeNaam brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:actieInhoud>${actieIdRegistratieOuder}</brp:actieInhoud>
          <brp:indicatieNamenreeks>J</brp:indicatieNamenreeks>
          <brp:geslachtsnaamstam>Brest naar Kempen</brp:geslachtsnaamstam>
        </brp:samengesteldeNaam>
        <brp:geboorte brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:actieInhoud>${actieIdRegistratieGeboorte}</brp:actieInhoud>
          <brp:datum>${vandaag(-10,0,0)}</brp:datum>
          <brp:gemeenteCode>1773</brp:gemeenteCode>
          <brp:woonplaatsnaam>Blauwestad</brp:woonplaatsnaam>
          <brp:landGebiedCode>6030</brp:landGebiedCode>
        </brp:geboorte>
        <brp:geslachtsaanduiding brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:actieInhoud>${actieIdRegistratieGeboorte}</brp:actieInhoud>
          <brp:code>V</brp:code>
        </brp:geslachtsaanduiding>
        <brp:bijhouding brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">
          <brp:actieInhoud>${actieIdCorrectieAdres3}</brp:actieInhoud>
          <brp:partijCode>170201</brp:partijCode>
          <brp:bijhoudingsaardCode>I</brp:bijhoudingsaardCode>
          <brp:nadereBijhoudingsaardCode>A</brp:nadereBijhoudingsaardCode>
          <brp:indicatieOnverwerktDocumentAanwezig>N</brp:indicatieOnverwerktDocumentAanwezig>
        </brp:bijhouding>
        <brp:bijhouding brp:verwerkingssoort="Verval" brp:voorkomenSleutel="*">
          <brp:actieInhoud>${actieIdRegistratieGeboorte}</brp:actieInhoud>
          <brp:actieVerval>${actieIdCorrectieAdres3}</brp:actieVerval>
          <brp:partijCode>034401</brp:partijCode>
          <brp:bijhoudingsaardCode>I</brp:bijhoudingsaardCode>
          <brp:nadereBijhoudingsaardCode>A</brp:nadereBijhoudingsaardCode>
          <brp:indicatieOnverwerktDocumentAanwezig>N</brp:indicatieOnverwerktDocumentAanwezig>
        </brp:bijhouding>
        <brp:adressen>
          <brp:adres brp:objecttype="PersoonAdres" brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">
            <brp:actieInhoud>${actieIdCorrectieAdres3}</brp:actieInhoud>
            <brp:soortCode>W</brp:soortCode>
            <brp:redenWijzigingCode>M</brp:redenWijzigingCode>
            <brp:datumAanvangAdreshouding>2010-01-01</brp:datumAanvangAdreshouding>
            <brp:identificatiecodeAdresseerbaarObject>1234567890123456</brp:identificatiecodeAdresseerbaarObject>
            <brp:identificatiecodeNummeraanduiding>1234017890123400</brp:identificatiecodeNummeraanduiding>
            <brp:gemeenteCode>1702</brp:gemeenteCode>
            <brp:naamOpenbareRuimte>wijk26</brp:naamOpenbareRuimte>
            <brp:afgekorteNaamOpenbareRuimte>straatnaam</brp:afgekorteNaamOpenbareRuimte>
            <brp:huisnummer>26</brp:huisnummer>
            <brp:postcode>4811BW</brp:postcode>
            <brp:woonplaatsnaam>Breda</brp:woonplaatsnaam>
            <brp:landGebiedCode>6030</brp:landGebiedCode>
          </brp:adres>
          <brp:adres brp:objecttype="PersoonAdres" brp:verwerkingssoort="Verval" brp:voorkomenSleutel="*">
            <brp:actieInhoud>${actieIdRegistratieGeboorte}</brp:actieInhoud>
            <brp:actieVerval>${actieIdCorrectieAdres3}</brp:actieVerval>
            <brp:soortCode>W</brp:soortCode>
            <brp:redenWijzigingCode>A</brp:redenWijzigingCode>
            <brp:datumAanvangAdreshouding>2014-09-14</brp:datumAanvangAdreshouding>
            <brp:gemeenteCode>0344</brp:gemeenteCode>
            <brp:naamOpenbareRuimte>Vredenburg</brp:naamOpenbareRuimte>
            <brp:afgekorteNaamOpenbareRuimte>Vredenburg</brp:afgekorteNaamOpenbareRuimte>
            <brp:huisnummer>3</brp:huisnummer>
            <brp:postcode>3511BA</brp:postcode>
            <brp:woonplaatsnaam>Smalle Ee</brp:woonplaatsnaam>
            <brp:landGebiedCode>6030</brp:landGebiedCode>
          </brp:adres>
        </brp:adressen>
        <brp:administratieveHandelingen>
          <brp:administratieveHandeling brp:objecttype="AdministratieveHandeling" brp:objectSleutel="*">
            <brp:code>05008</brp:code>
            <brp:naam>Correctie adres</brp:naam>
            <brp:categorie>Correctie</brp:categorie>
            <brp:partijCode>036101</brp:partijCode>
            <brp:bronnen>
              <brp:bron brp:objecttype="AdministratieveHandelingBron" brp:communicatieID="*">
                <brp:document brp:objecttype="Document" brp:voorkomenSleutel="*" brp:objectSleutel="*">
                  <brp:soortNaam>Aangifte met betrekking tot verblijfplaats</brp:soortNaam>
                  <brp:identificatie>123</brp:identificatie>
                  <brp:aktenummer>4567890</brp:aktenummer>
                  <brp:partijCode>036101</brp:partijCode>
                </brp:document>
              </brp:bron>
            </brp:bronnen>
            <brp:bijgehoudenActies>
              <brp:actie brp:objecttype="Actie" brp:objectSleutel="actie${actieIdCorrectieAdres1}">
                <brp:soortNaam>Correctie adres</brp:soortNaam>
                <brp:bronnen>
                  <brp:bron brp:objecttype="ActieBron" brp:referentieID="*"/>
                </brp:bronnen>
              </brp:actie>
              <brp:actie brp:objecttype="Actie" brp:objectSleutel="actie${actieIdCorrectieAdres3}">
                <brp:soortNaam>Correctie adres</brp:soortNaam>
                <brp:bronnen>
                  <brp:bron brp:objecttype="ActieBron" brp:referentieID="*"/>
                </brp:bronnen>
              </brp:actie>
            </brp:bijgehoudenActies>
          </brp:administratieveHandeling>
          <brp:administratieveHandeling brp:objecttype="AdministratieveHandeling" brp:objectSleutel="*">
            <brp:code>01002</brp:code>
            <brp:naam>Geboorte in Nederland met erkenning</brp:naam>
            <brp:categorie>Actualisering</brp:categorie>
            <brp:partijCode>036101</brp:partijCode>
            <brp:bronnen>
              <brp:bron brp:objecttype="AdministratieveHandelingBron" brp:communicatieID="*">
                <brp:document brp:objecttype="Document" brp:voorkomenSleutel="*" brp:objectSleutel="*">
                  <brp:soortNaam>Geboorteakte</brp:soortNaam>
                  <brp:identificatie>GA0530-1C0001</brp:identificatie>
                  <brp:aktenummer>1CA0001</brp:aktenummer>
                  <brp:partijCode>036101</brp:partijCode>
                </brp:document>
              </brp:bron>
            </brp:bronnen>
            <brp:bijgehoudenActies>
              <brp:actie brp:objecttype="Actie" brp:objectSleutel="actie${actieIdRegistratieGeboorte}">
                <brp:soortNaam>Registratie geboorte</brp:soortNaam>
                <brp:bronnen>
                  <brp:bron brp:objecttype="ActieBron" brp:referentieID="*"/>
                </brp:bronnen>
              </brp:actie>
              <brp:actie brp:objecttype="Actie" brp:objectSleutel="actie${actieIdRegistratieIdentificatienummers}">
                <brp:soortNaam>Registratie identificatienummers</brp:soortNaam>
                <brp:bronnen>
                  <brp:bron brp:objecttype="ActieBron" brp:referentieID="*"/>
                </brp:bronnen>
              </brp:actie>
              <brp:actie brp:objecttype="Actie" brp:objectSleutel="actie${actieIdRegistratieOuder}">
                <brp:soortNaam>Registratie ouder</brp:soortNaam>
                <brp:bronnen>
                  <brp:bron brp:objecttype="ActieBron" brp:referentieID="*"/>
                </brp:bronnen>
              </brp:actie>
            </brp:bijgehoudenActies>
          </brp:administratieveHandeling>
        </brp:administratieveHandelingen>
      </brp:persoon>
    </brp:bijgehoudenPersonen>
  </brp:synchronisatie>
</brp:lvg_synVerwerkPersoon>
  </soap:Body>
</soap:Envelope></DATA>
            <NAAM>Abo met alleen verantwoordingsinfo True</NAAM>
        </Row>
    </ResultSet>
</Results>